In [1]:
import pandas as pd
import numpy as np

In [15]:

df = pd.read_csv('Human Resources.csv')

df.head() 
df.describe()
df.dtypes
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22214 entries, 0 to 22213
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              22214 non-null  object
 1   first_name      22214 non-null  object
 2   last_name       22214 non-null  object
 3   birthdate       22214 non-null  object
 4   gender          22214 non-null  object
 5   race            22214 non-null  object
 6   department      22214 non-null  object
 7   jobtitle        22214 non-null  object
 8   location        22214 non-null  object
 9   hire_date       22214 non-null  object
 10  termdate        3929 non-null   object
 11  location_city   22214 non-null  object
 12  location_state  22214 non-null  object
dtypes: object(13)
memory usage: 2.2+ MB

In [25]:
df['Full_name'] = df['first_name'] + " " +df['last_name']

df = df.drop(['first_name', 'last_name'], axis = 1)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22214 entries, 0 to 22213
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              22214 non-null  object
 1   first_name      22214 non-null  object
 2   last_name       22214 non-null  object
 3   birthdate       22214 non-null  object
 4   gender          22214 non-null  object
 5   race            22214 non-null  object
 6   department      22214 non-null  object
 7   jobtitle        22214 non-null  object
 8   location        22214 non-null  object
 9   hire_date       22214 non-null  object
 10  termdate        3929 non-null   object
 11  location_city   22214 non-null  object
 12  location_state  22214 non-null  object
 13  Full_name       22214 non-null  object
dtypes: object(14)
memory usage: 2.4+ MB

In [26]:

# Convert type for memory 
df = df.astype({'id':'string', 'Full_name':'category', 'gender': 'category', 'race': 'category',
           'department':'category', 'jobtitle': 'category', 'location': 'category','location_city':'category', 'location_state':'category' })



# Convert dates 
df['hire_date'] = pd.to_datetime(df['hire_date'], utc=True,  errors='coerce')
df['termdate'] = pd.to_datetime(df['termdate'], utc=True, errors='coerce')
df['birthdate'] = pd.to_datetime(df['birthdate'],utc=True, errors='coerce')

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22214 entries, 0 to 22213
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              22214 non-null  string
 1   birthdate       22214 non-null  datetime64[ns, UTC]
 2   gender          22214 non-null  category
 3   race            22214 non-null  category
 4   department      22214 non-null  category
 5   jobtitle        22214 non-null  category
 6   location        22214 non-null  category
 7   hire_date       13497 non-null  datetime64[ns, UTC]
 8   termdate        3929 non-null   datetime64[ns, UTC]
 9   location_city   22214 non-null  category
 10  location_state  22214 non-null  category
 11  Full_name       22214 non-null  category
dtypes: category(8), datetime64[ns, UTC](3), string(1)
memory usage: 1.6 MB

In [34]:
print(df['hire_date'].notnull().sum())
df['hire_date'].isnull().sum()

13497

np.int64(8717)

### As column contains  8717 null values betterto

In [35]:
df['hire_date'].isnull().mean() * 100

np.float64(39.241019177095524)

In [38]:
# Find valid hire date range
min_date = df['hire_date'].min()
max_date = df['hire_date'].max()

# Fill missing hire_date values randomly within valid range
num_missing = df['hire_date'].isnull().sum()
random_dates = pd.to_datetime(
    np.random.choice(pd.date_range(min_date, max_date), num_missing)
)

df.loc[df['hire_date'].isnull(), 'hire_date'] = random_dates


# Verify results
filled_info = {
    "total_rows": len(df),
    "filled_missing_hire_dates": num_missing,
    "min_hire_date": str(min_date),
    "max_hire_date": str(max_date),
    "still_missing_after_fill": df['hire_date'].isnull().sum()
}

filled_info

{'total_rows': 22214,
 'filled_missing_hire_dates': np.int64(8717),
 'min_hire_date': '2000-10-17 00:00:00+00:00',
 'max_hire_date': '2020-12-13 00:00:00+00:00',
 'still_missing_after_fill': np.int64(0)}

In [30]:
df.columns

Index(['id', 'birthdate', 'gender', 'race', 'department', 'jobtitle',
       'location', 'hire_date', 'termdate', 'location_city', 'location_state',
       'Full_name'],
      dtype='object')

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22214 entries, 0 to 22213
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              22214 non-null  string
 1   birthdate       22214 non-null  datetime64[ns, UTC]
 2   gender          22214 non-null  category
 3   race            22214 non-null  category
 4   department      22214 non-null  category
 5   jobtitle        22214 non-null  category
 6   location        22214 non-null  category
 7   hire_date       22214 non-null  datetime64[ns, UTC]
 8   termdate        3929 non-null   datetime64[ns, UTC]
 9   location_city   22214 non-null  category
 10  location_state  22214 non-null  category
 11  Full_name       22214 non-null  category
dtypes: category(8), datetime64[ns, UTC](3), string(1)
memory usage: 1.6 MB

In [43]:
df

,id,birthdate,gender,race,department,jobtitle,location,hire_date,termdate,location_city,location_state,Full_name
0,00-0037846,1991-06-04 00:00:00+00:00,Male,Hispanic or Latino,Engineering,Programmer Analyst I,Headquarters,2002-01-20 00:00:00+00:00,NaT,Cleveland,Ohio,Kimmy Walczynski
1,00-0041533,1984-06-29 00:00:00+00:00,Male,White,Business Development,Business Analyst,Headquarters,2014-12-29 00:00:00+00:00,NaT,Cleveland,Ohio,Ignatius Springett
2,00-0045747,1989-07-29 00:00:00+00:00,Male,Black or African American,Sales,Solutions Engineer Manager,Headquarters,2009-05-15 00:00:00+00:00,NaT,Cleveland,Ohio,Corbie Bittlestone
3,00-0055274,1982-09-14 00:00:00+00:00,Female,White,Services,Service Tech,Headquarters,2015-02-22 00:00:00+00:00,NaT,Cleveland,Ohio,Baxy Matton
4,00-0076100,1994-04-11 00:00:00+00:00,Female,Two or More Races,Product Management,Business Analyst,Remote,2010-09-29 00:00:00+00:00,2029-10-29 06:09:38+00:00,Flint,Michigan,Terrell Suff
...,...,...,...,...,...,...,...,...,...,...,...,...
22209,99-9797418,1998-07-08 00:00:00+00:00,Female,Hispanic or Latino,Research and Development,Research Assistant I,Headquarters,2016-12-18 00:00:00+00:00,NaT,Cleveland,Ohio,Dorella Garvan
22210,99-9869877,2001-04-19 00:00:00+00:00,Female,Two or More Races,Services,Service Manager,Headquarters,2005-05-06 00:00:00+00:00,NaT,Cleveland,Ohio,Dasie Thorsby
22211,99-9919822,2070-02-09 00:00:00+00:00,Female,Two or More Races,Training,Junior Trainer,Headquarters,2020-04-11 00:00:00+00:00,NaT,Cleveland,Ohio,Nerty Wilding
22212,99-9960380,1985-09-02 00:00:00+00:00,Male,Two or More Races,Accounting,Staff Accountant I,Headquarters,2015-07-06 00:00:00+00:00,2012-12-10 14:29:59+00:00,Cleveland,Ohio,Mabelle Dawks
22213,99-9963543,1999-07-10 00:00:00+00:00,Female,White,Engineering,Software Engineer III,Remote,2018-03-27 00:00:00+00:00,NaT,Fort Wayne,Indiana,Carroll Chattaway